// pages/policy/policy.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    pushTime:"2021年10月28日",
    activeTime:"2021年11月4日",
    content:'我们高度重视用户的隐私保护。本政策详细说明了我们如何收集、使用、存储、共享和保护您的个人信息，以及您享有的相关权利。请仔细阅读本政策。<br /><b>一、信息收集范围</b><br />我们可能收集以下类型的个人信息：<br />您提供的信息<br />注册或使用服务时填写的姓名、电话、邮箱、地址等联系方式。<br />交易信息（如订单记录、支付凭证）。<br />用户反馈、咨询或投诉内容。<br /><b>自动收集的信息</b><br />设备信息：IP地址、浏览器类型、操作系统、设备标识符。<br />使用数据：访问时间、页面浏览记录、点击行为、Cookie及类似技术（详见“Cookie政策”部分）。<br /><b>第三方来源信息</b><br />通过合作方（如社交媒体、广告平台）合法共享的数据。<br /><b>二、信息使用目的</b>我们仅在合法、必要的前提下使用您的信息，包括但不限于：<br />提供、维护和改进服务；<br />处理订单、验证身份及完成支付；<br />发送重要通知（如政策变更、账户安全提醒）；<br />通过数据分析优化用户体验；<br />开展合规的营销活动（如您同意接收推广信息）。<br /><b>三、信息共享与披露</b>我们承诺在以下情况下才会共享信息：<br />征得您的明确同意；<br />第三方服务提供商：与合作的物流、支付、云服务等供应商共享必要信息，并确保其遵守保密义务；<br />法律要求：响应司法机关、政府部门的合法请求；<br />企业交易：如发生合并、收购等情形，我们将通知您信息转移事宜。<br /><b>四、数据安全措施</b><br />我们采取行业标准的技术与管理措施保护数据安全，包括：<br />加密传输（SSL/TLS）与存储；<br />定期安全审计与漏洞修复；<br />严格的内部权限管控。<br /><b>五、您的权利</b><br />根据适用法律，您可能享有以下权利：<br />访问、更正或删除个人信息；<br />撤回已同意的数据处理；<br />获取数据副本或限制处理；<br />通过[指定邮箱/电话]联系我们行使权利。<br /><b>六、Cookie与追踪技术</b><br />我们使用Cookie提升服务体验，您可通过浏览器设置拒绝非必要Cookie，但可能影响部分功能。<br /><b>七、政策更新</b><br />我们可能适时修订本政策，更新版本将发布于官网并显著提示。继续使用服务视为接受修订内容。<br /><b>注意事项：</b><br />根据业务实际补充数据处理的法律依据（如GDPR、CCPA等适用法律条款）；<br />若涉及跨境数据传输，需单独说明；<br />建议由法律顾问审核以确保合规性。<br />'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})